![image](https://user-images.githubusercontent.com/57321948/196933065-4b16c235-f3b9-4391-9cfe-4affcec87c35.png)

# Name: Mohammad Wasiq

## E-mail: `mohammadwasiq0786@gmail.com`

### SQL Assignment - 6

**Q1 :** Write an SQL query to print details of the Workers who have joined in Febâ€™2014.

**Ans :**

* **Method 1**
```sql
SELECT * FROM Worker WHERE YEAR(JOINING_DATE) = 2014 AND MONTH(JOINING_DATE) =02;
```

* **Method 2**
```sql
SELECT * FROM Worker WHERE JOINING_DATE LIKE "%2014-02%";
```

**Q2 :** Write an SQL query to fetch duplicate records having matching data in some fields of a table.

**Ans :**

```sql
SELECT column_name, COUNT(column_name) FROM Worker GROUP BY FEILD HAVING COUNT(column_name) > 1; 
```

**Q3 :** How to remove duplicate rows from Employees table.

**Ans :**

```sql
CREATE TABLE Employee (
    ID INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
    FIRST_NAME VARCHAR(50),
    LAST_NAME VARCHAR(50),
    COUNTRY VARCHAR(50)
);
```

```sql
INSERT INTO Employee VALUES 
(1, 'Mohammad', 'Wasiq', 'INDIA'),
(2, 'Altamash', 'Pasha', 'INDIA'),
(3, 'Zainul', 'Abedeen', 'INDIA'),
(4, 'STEVE', 'JOBS', 'USA'),
(5, 'STEVE', 'JOBS', 'USA'),
(6, 'STEVE', 'JOBS', 'USA');
```

```sql
DELETE e1.* from employee e1 INNER JOIN employee e2 WHERE e1.id > e2.id AND
e1.FIRST_NAME = e2.FIRST_NAME AND e1.LAST_NAME = e2.LAST_NAME AND e1.COUNTRY =
e2.COUNT
```